//** @file
//   Strings for Console Redirection Config DXE
//
//;******************************************************************************
//;* Copyright (c) 2015, Insyde Software Corp. All Rights Reserved.
//;*
//;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
//;* transmit, broadcast, present, recite, release, license or otherwise exploit
//;* any part of this publication in any form, by any means, without the prior
//;* written permission of Insyde Software Corporation.
//;*
//;******************************************************************************

/=#

#include "Standard.uni"
#string STR_EFI_SETUP_UTILITY_TITLE     #language en-US        "InsydeH2O Setup Utility"
                                        #language fr-FR        "Logiciel de Configuration d'InsydeH2O"
                                        #language zh-TW        "\wide系微\narrow H2O \wide設定工具\narrow"
                                        #language ja-JP        "InsydeH2O \wideセットアップユーティリティ\narrow"
                                        #language it-IT        "Configuratore InsydeH2O"
                                        #language es-ES        "Utilitario de la programación de InsydeH2O"
                                        #language de-DE        "InsydeH2O-Anbringung"
                                        #language pt-PT        "Configura Utilidade do InsydeH2O"
#string STR_BLANK_STRING                #language en-US        " "
                                        #language fr-FR        " "
                                        #language zh-TW        " "
                                        #language ja-JP        " "
                                        #language it-IT        " "
                                        #language es-ES        " "
                                        #language de-DE        " "
                                        #language pt-PT        " "
#string STR_YES_TEXT                    #language en-US        "Yes"
                                        #language fr-FR        "Oui"
                                        #language zh-TW        "\wide是\narrow"
                                        #language ja-JP        "\wideはい\narrow"
                                        #language it-IT        "Si"
                                        #language es-ES        "Sí"
                                        #language de-DE        "Ja"
                                        #language pt-PT        "Sim"
#string STR_NO_TEXT                     #language en-US        "No"
                                        #language fr-FR        "Non"
                                        #language zh-TW        "\wide否\narrow"
                                        #language ja-JP        "\wideいいえ\narrow"
                                        #language it-IT        "No"
                                        #language es-ES        "Sí"
                                        #language de-DE        "Nein"
                                        #language pt-PT        "Não"
#string STR_DISABLED_TEXT               #language en-US        "Disabled"
                                        #language fr-FR        "Désactiver"
                                        #language zh-TW        "\wide停用\narrow"
                                        #language ja-JP        "\wide使用しない\narrow"
                                        #language it-IT        "Disabilitato"
                                        #language es-ES        "inhabilitado"
                                        #language de-DE        "Sperren"
                                        #language pt-PT        "Proibir"
#string STR_ENABLED_TEXT                #language en-US        "Enabled"
                                        #language fr-FR        "Activer"
                                        #language zh-TW        "\wide啟用\narrow"
                                        #language ja-JP        "\wide使用する\narrow"
                                        #language it-IT        "abilitato"
                                        #language es-ES        "permitido"
                                        #language de-DE        "Aktivieren"
                                        #language pt-PT        "Permitir"
#string STR_AUTO_TEXT                   #language en-US        "Auto"
                                        #language fr-FR        "Automatique"
                                        #language zh-TW        "\wide自動\narrow"
                                        #language ja-JP        "\wide保存する\narrow"
                                        #language it-IT        "Auto"
                                        #language es-ES        "Auto"
                                        #language de-DE        "Automatisch"
                                        #language pt-PT        "Auto"                                   

#string STR_SOL_TITLE_FORMSET           #language en-US        "SOL LAN Configuration (new)"
#string STR_SOL_TITLE_HELP              #language en-US        "SOL Setup Menu"
#string STR_SOL_SOL_ENABLE              #language en-US        "  SOL Enable"
#string STR_SOL_USE_DHCP                #language en-US        "  USE DHCP"
#string STR_SOL_HOST_IP_ADDRESS         #language en-US        "    IP Address"
#string STR_SOL_HOST_IP_ADDRESS_INPUT   #language en-US        " IpAddr"
#string STR_SOL_HOST_MASK               #language en-US        "    Subnet Mask" 
#string STR_SOL_HOST_MASK_INPUT         #language en-US        " MaskAddr" 
#string STR_SOL_HOST_GATEWAY            #language en-US        "    Gateway"
#string STR_SOL_HOST_GATEWAY_INPUT      #language en-US        " GatewayAddr"
#string STR_SOL_ADMIN_IP                #language en-US        "  Administrator IP"
#string STR_SOL_ADMIN_IP_INPUT          #language en-US        ""
#string STR_SOL_ADMIN_MAC               #language en-US        "  Administrator MAC"
#string STR_SOL_ADMIN_MAC_INPUT         #language en-US        ""
#string STR_SOL_LOGIN_NAME              #language en-US        "  Login Name"
#string STR_SOL_LOGIN_NAME_INPUT        #language en-US        ""
#string STR_SOL_LOGIN_PASSWORD          #language en-US        "  Password"
#string STR_SOL_LOGIN_PASSWORD_INPUT    #language en-US        ""

#string STR_NAME_VALUE_VAR_NAME0        #language en-US "MyNameValue0"